# Applications
tap 'homebrew/cask'
brew 'cask'
cask_args appdir: '/Applications'
cask 'cakebrew'

# Web applications
sudo softwareupdate --install-rosetta
cask 'choosy'
cask 'firefox'
cask 'google-chrome'

# Communication apps
cask 'skype'
cask 'slack'
cask 'wavebox'
cask 'zoom'
cask 'signal'
cask 'element'

# Passwords
cask 'keybase'
cask 'gpg-suite'

# File sharing apps
cask 'dropbox'

## App Store
mas 'Brother iPrint&Scan', id: 1193539993
mas 'Divvy', id: 413857545
mas 'HP Easy Scan', id: 967004861
mas 'HP Smart for Desktop', id: 1474276998
mas 'Keynote', id: 409183694
mas 'Memory Clean 3', id: 1302310792
mas 'Mic Drop.', id: 1489816366
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'PDF Expert', id: 1055273043
mas 'Pixelmator Pro', id: 1289583905
mas 'TweetDeck by Twitter', id: 485812721
mas 'Microsoft To Do', id: 1274495053
mas 'Xcode', id: 497799835

# Other
brew 'git'
cask 'docker'
brew 'node'
brew 'php'
brew 'composer'
brew 'wp-cli'
cask 'visual-studio-code'
cask 'amazon-music'
cask 'bartender'
cask 'cloudup'
cask 'encryptme'
cask 'github'
cask 'local'
cask 'logitech-presentation'
cask 'openvpn-connect'
cask 'send-to-kindle'
cask 'versions'
