# Specify directory where to install Homebrew apps
cask_args appdir: "/Applications"

# Homebrew basics
brew analytics off
tap "homebrew/bundle"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
brew "mas"
brew "cask"

# Base utilities
brew "composer"
brew "git"
brew "node"
brew "php"
brew "svn"
brew "wp-cli"

# Web applications
# sudo softwareupdate --install-rosetta
cask "choosy"
cask "firefox"
cask "google-chrome"

# Communication apps
cask "slack"
cask "wavebox"
cask "zoom"

# Security and Password apps
cask "avast-security"
cask "bitwarden"
cask "keybase"
cask 'openvpn-connect'
cask "gpg-suite"

# Development apps
cask "github"
cask "iterm2"
cask "local"
cask "wordpresscom-studio"
cask "visual-studio-code"

# File sharing apps
cask "dropbox"

## App Store
mas 'Brother iPrint&Scan', id: 1193539993
# mas 'Divvy', id: 413857545
mas 'HP Easy Scan', id: 967004861
mas 'HP Smart for Desktop', id: 1474276998
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator Pro', id: 1289583905
mas 'Microsoft To Do', id: 1274495053

# Other apps
cask "amazon-music"
cask "appzapper"
cask "bartender"
cask "cloudup"
cask "memory-clean-3"
cask "pdf-expert"
cask "pocket-casts"
cask "screen-studio"
cask "sound-control"
cask "ultimaker-cura"
